{"pageProps":{"meta":{"title":"講義班紹介 (2022年度)","date":"2022-04-10","caption":"2022年度講義班紹介ページを公開しました"},"year":"2022","slug":"lecture","body":"\n本年度開講が決まっている班をご紹介します。\n\n変更が生じる可能性もありますので予めご了承ください。\n\n<!--\n## Unity班\n\n### 目標\n\nゲームを作れるレベルまで、Unity及びC#の扱い方を学び、最終的には1人、或いは複数人で協力して、何かしらのゲームを作成出来るようになることを目指します。  \n\n### 使用言語・ツール\n\nC#, Unity, GitHub\n\n### アピールポイント\n\nUnityはプロトタイプ作成に優れたソフトですので、自分の思う事を即座に形に出来ます。  \nまた、昨今Unityの地位は上がっており、社会に出てからもUnityのスキルは大いに活かせることでしょう。  \n\n### 班長から一言\n\nゲームを作れると楽しいよ！\n-->\n\n## C/C++班\n\n### 活動概要\n\nC/C++はプログラミング言語の一つです。最初にプログラミングの基礎的なことを学びます。  \nその後主に以下の2つのプロジェクト班に分かれて活動を行います。\n\n* **C/C++**  \nプログラミング言語の一つです。一番最初にプログラミングの基礎的なことを学びます。\n* **Ray Tracing**  \n略称は“レイトレ“。コンピュータで、実際にカメラで撮った写真のような、リアルな画像を作る方法を学びます。[公式サイト](https://p-ray.oskt.us/) から活動の詳細について見ることができます。\n* **競技プログラミング**  \n競技プログラミングとはプログラムを作成して数理パズルを解くコンテストです！ジャッジが機械的に行われることが特徴です。オンラインで開催される形式が多いので年齢、地域を問わず世界中の人が同時に参加しています。トップレベルでは数オリ経験者などが活躍しています。頭脳に自信がある方はその才能を遺憾無く発揮できるのではないでしょうか！<br>競技的な側面ばかり言ってきましたが、競技プログラミングはプログラミングの勉強にも適しています。プログラミングは覚えたことを使っていかないと身につきません。しかし、作りたいものがなかったり、プログラミング以外の要因で躓いたりすることが多いと思います。そういった悩みを解決してくれるという点で競技プログラミングは優れています！後、楽しいです。パズルを解くのは楽しいので。AtCoderという日本語のサイトでは週一回beginner向けの典型問題が中心のコンテストが開催されています。ぜひ参加しましょう！！\n\n  **班長から一言**\n  \n  本サークルの競技プログラミング班では2022年度講義を[@preds1dent](https://twitter.com/Preds1dent)が担当します。大学に入ってから競技プログラミングに出会い、1から勉強しています。AtCoderのレーティングは水色(2022/4/17)で、僕もBeginnerコンテストの対象です。競技的なレベルまで講義では扱いませんが、基礎的なアルゴリズムは大体網羅しているので、競技プログラミングで戦える武器を揃えることを目標に講義を進めていきます。<br>これは蛇足ですが、週一回プログラムを書く生活をしていると、大学一年生のプログラミングの授業はマジで楽になるのでおすすめします。C++しかやりませんが、コツを掴めるのでpythonもかなり楽になります。\n### 目標\n\nC/C++を楽しく学び一人でもプログラミングできるようにする。\n\n### 特色\n\nC/C++はその数値の計算や記憶、読み込みなどを組み合わせて自由自在なプログラムを作ることができます。  \nまた、1からプログラムを作るため計算の流れなどが可視化されやすいです。\n\n### アピールポイント\n\n他の言語に比べて関数が少ない分、どのようにプログラムが動き実行されているのかの理解が深まります。  \nプログラミングを学びたいが何を作りたいかが決まっていないような人にはおすすめです。  \nまたC/C++は授業で扱う学科も多いため、その予習になります。\n\n### 班長から一言\n\nRay Tracing や 競技プログラミングをやりたい人はぜひ参加してください！ 未経験者でも大歓迎です！ わからないことはいつでも聞いてください！\n\n### 参考画像\n\n![](https://i.imgur.com/7E9fVom.png)\n\n![](https://i.imgur.com/BdzcBUU.png)\n"},"__N_SSG":true}