{"pageProps":{"meta":{"title":"応用数学研究部規約","date":"2023-01-30","caption":"応用数学研究部規約を公開しました"},"year":"2023","slug":"club-rules","body":"\n<!-- # 応用数学研究部規約 -->\n\n## 第一章　総則\n\n### 第一条　名称\n\n本部は、東京理科大学応用数学研究部（以下、応数研と略す）と称し、東京理科大学Ⅰ部研究会に属する。\n\n### 第二条　目的\n\n本部は、共同研究活動によって部員の応用数学と、応用数学の研究媒体であるコンピュータのソフトウェアに関する知識及び関心を高め、あわせてその成果を社会一般に役立てることを目的とする。\n\n### 第三条　運営委員会\n\n本部は、第二条の目的を達成するために、また、本部の運営が円滑に行えるように運営委員会を設け、その活動にあたっては運営委員会規則に従う。\n\n## 第二章　部員\n\n### 第四条 入部\n以下の資格を持っている者は、部長に届け出ることにより入部する。\n\n1. 本部の活動に参加できる大学生、または、それに準ずる者\n2. 本部が参加している組織、団体の規約に則っている者\n\n### 第五条 退部\n部員は、部長に届け出ることにより退部する。 また、役員会にて、退部勧告処分を決定された者は在部か退部の意思表示をする必要があり、除名処分を決定された者は強制的に退部する。\n\n## 第三章　総会\n\n### 第六条　権限\n\n総会は、応数研の最高議決機関であり、全部員により構成される。但し、新入生は1回目の総会までは議決権を持たないものとする。\n\n### 第七条　招集\n\n定期総会は年二回とし、五、六月及び十一、十二月の適当な日を運営委員会、または部長が選んで招集する。\n\n総会では主として、予算の承認、次期役員の承認、班の承認、及び、決算報告の承認を目的とする。\n\n部員の五分の二以上、または運営委員会の要請により臨時総会を招集することができる。\n\n総会の招集に関しては、部長がその会議の目的である事項を掲げ通知する。\n\n### 第八条　決議方法\n\n総会は委任状を含め、三分の二以上部員が出席したときに成立する。但し、委任状は委任状を含めない出席者数の三分の二まで有効とする。\n議決は、部長及び委任状を含めない議決権を持つ出席者数の三分の二以上の賛成を持って成立する。\n\n### 第九条　傍聴\n\n原則として、希望者の総会の傍聴を認める。\n\n## 第四章　部会\n\n### 第十条　権限\n\n部会は応数研の総会に次ぐ決議機関であり、全部員により構成される。但し、部会に出席している役員の過半数が認めた場合を除き入部後二ヶ月に満たない部員は議決権を持たないものとする。\n\n### 第十一条　招集\n\n部会は、原則として週一回定時に開会する。但し、部員の五分の一以上、運営委員会または部長の発議により招集することができる。その部会の召集に関して、部長は、会議の目的である事項を掲げて通知する。休会については、運営委員会または部長が決定する。\n\n### 第十二条　決議方法\n\n部会の決議は、委任状も含めて、三分の一以上の部員が出席することを条件とし、委任状を含めない議決権を持つ出席者数の多数決によって決定する。但し、委任状は出席者数を超えない分を有効とする。\n\n### 第十三条　傍聴\n\n原則として、希望者の部会の傍聴を認める。\n\n## 第五章　役員\n\n### 第十四条　役員の種類\n\n本部は、次の役員を設置する。\n\n1. 部長（一名）\n  本部の最高責任者であり、代表者である。部会・総会の議事を進行する。 副部長の一人がこれを兼ねることができる。\n2. 副部長（若干名）\n  部長を補佐し、部長に事故ある時は一名が部長を代行する。\n3. マネージャー（若干名）\n  合宿及びコンパなどで幹事を行う。\n4. 会計（若干名）\n  本部の財務を担当する。\n5. 書記（若干名）\n  本部の活動状況を記録し、要請があれば顧問に提出する。\n6. 渉外（若干名）\n  本部の対外的交渉を担当する。\n\nなお、必要があれば総会にて新たな役職を設けることができる。\n\n### 第十五条　役員の選出\n\n役員は、総会にて選出される。なお、投票による選出は、候補者と投票者以外の第三者を立てて厳正に行うものとする。\n\n### 第十六条　任期\n\n役員の任期は、選出された日の翌日より、次期役員が選出される日までとする。\n\n### 第十七条　解職請求\n\n役員の解職請求は、部員の五分の二以上、または、運営委員会の要請により総会の議題となる。\n\n## 第六章　会計\n\n### 第十八条　会計年度\n\n本部の会計年度は、毎年四月一日より翌年三月三十一日までとする。\n\n### 第十九条　予算の報告\n\n本部は、収支予算を年度ごとに作成し、総会の議決によってこれを定めなければならない。\n\n### 第二十条　決算の報告\n\n本部は、収支決算を年度ごとに作成し、次年度に総会の承認を得なければならない。\n\n### 第二十一条　経費\n本部の経費は、部費、その他支援金等の収入をもって充てる。\n\n## 第七章　補則\n\n### 第二十二条　細則\n\n本規約の補助として細則を他に定める。なお、細則で本規約の条項の内容を上書きすることはできない。もし、本規約と細則の内容に不一致や矛盾が生じた場合、本規約を優先とする。\n\n### 第二十三条　改正\n\n本規約は、総会の議決によって改正できる。\n\n### 第二十四条　有効期間\n\n本規約は、令和三年四月二十五日より有効となる。有効期間は次の規約が有効になるまでとする。\n\n## 運営委員会　規則\n\n### 第一条　構成\n\n本会は応数研の各役員をもってこれを構成する。但し、本会で必要と認めた場合に増員することができる。\n\n### 第二条　開催\n\n本会は部長の召集により開催する。但し、部長または他の一名以上の運営委員会の要請により臨時開催できる。\n\n### 第三条　定足数・決議\n\n本会の定足数は委任状も含め、役員の三分の二以上とし、出席の過半数でこれを決議し可否同数のときは部長の決する所による。但し、委任状は出席者数を超えない分のみ有効とする。\n\n### 第四条　議事録\n\n本会の議事録は書記がこれを作成しなければならない。\n\n### 第五条　報告義務\n\n本会の活動は原則として部会を通じて全部員に報告しなければならない。\n\n### 第六条　勧告・除名\n\n本会は次の者に退部勧告もしくは除名することができる。\n\n1. 本会で部員として不適当と認めた者\n2. 部費を滞納した者\n\n### 第七条　役員の義務\n\n本会の役員は、誠実にその職務を担当しなければならない。  \n運営委員会は運営執務・その他の役員としての職務を怠った者に対して、役員の解職ができる。\n\n### 第八条　実行委員\n\n本会または部長は、必要に応じて職務内容を明示して、その遂行のために実行委員を任命することができる。実行委員は職務を負い遂行し、また中止と同時に解任するものとする。\n\n### 第九条　傍聴\n\n原則として、希望者の運営委員会の傍聴を認める。\n\n# 規約細則\n\n### 第一条　班\n\n本部は、本部を構成するものとして、班を設ける。\n\n部員は班に属さなければならない。\n\n### 第二条　班の新設・廃止\n\n班は、総会及び部会の議決によって新設・廃止することができる。\n\n### 第三条　本部の活動\n\n本部は規約第二条の目的を達成するために次のような活動を行う。\n\n1. 班活動\n2. 部員の教育\n3. 図書・文献の閲覧・貸出し\n4. 機関誌・その他の発刊\n5. その他の本部の目的を達成するために必要な活動\n\n### 第四条　連絡場所\n\n本部は連絡場所として部室を割り当てる。\n\n### 第五条　部費\n\n部員は、年度ごとに運営委員会の議決により定められた部費を支払わなければならない。\n納入期限は、原則として会計が定めるところによる。\n\n### 第六条　改正\n\n本細則は、総会、及び部会の議決によって改正できる。\n\n### 第七条　有効期間\n\n本細則は、令和三年四月二十五日より有効となる。有効期間は次の規約が有効になるまでとする。\n"},"__N_SSG":true}